Revit 2027 API
Solid.Edges Property
The edges that belong to the solid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public EdgeArray Edges { get; }
Public ReadOnly Property Edges As EdgeArray
	Get
public:
property EdgeArray^ Edges {
	EdgeArray^ get ();
}
member Edges : EdgeArray with get
Property Value
EdgeArray
See Also
Reference
Solid Class
Autodesk.Revit.DB Namespace